#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: README
#+date: <2021-09-19 Sun>
#+author:
#+email: mnasoft@gmail.com
#+language: ru
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.2 (Org mode 9.4.4)
#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:t html-style:t
#+options: html5-fancy:nil tex:t
#+html_doctype: xhtml-strict
#+html_container: div
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head:
#+html_head_extra:
#+subtitle:
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)
#+latex_header:

* Поиск файла тренда в каталоге
 Функция =r/dir:find-trd-by-utime-dirname= возвращает объект тренда,
для которого существуют данные на момент универсального времени utime
в каталоге dir-name.
#+name: recoder-dir-find-trd-by-utime-dirname   
#+BEGIN_SRC lisp :exports both
  ;;"D:/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/"
  (recoder/org:header
   (r/dir:find-trd-by-utime-dirname
    (recoder/trd:time-universal-encode 2018 11 06 09 23 50)
    (namestring
     (merge-pathnames #P"trd/"
                      (asdf:system-source-directory :recoder)))))
#+END_SRC

#+RESULTS: recoder-dir-find-trd-by-utime-dirname
| Файл                                | D:/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/2018-11-06_092329.trd |
| Версия тренда                       |                                                                                          2 |
| Дата создания тренда                |                                                                                 2018-11-06 |
| Время создания тренда               |                                                                                   09:23:29 |
| К-во аналоговых+дискретных сигналов |                                                                                        415 |
| Общее число записей в тренде        |                                                                                      15706 |
| Интервал между записями тренда      |                                                                                     0.25d0 |
| Количество аналоговых сигналов      |                                                                                        314 |
| Количество дискретных сигналов      |                                                                                        101 |

* Формирование списка сигналов из списка имен сигналов 
#+BEGIN_SRC lisp
  (recoder/slist:a-signals *trd* signal-string-list)
#+END_SRC

* Извлечение данных из тренда
** Создание списка сигналов
#+name: s-names
#+begin_src lisp :exports both
  (defparameter *trd* recoder/trd:*trd*)
  (defparameter *s-names* '("V2" "P02" "T2" "ET300" "FA530" "FK526" "FA526" "FA566" "KAZNA-SCHO"))
  ,*s-names*
#+end_src

 Возвращает список аналоговых сигналов тренда trd, которые
 соответствуют списку обозначений сигналов из списка
 signal-string-list

*recoder:trd-discret-signal-list* (x trd) signal-string-list

Возвращает список дискретных сигналов тренда trd, которые соответствуют списку обозначений сигналов из списка signal-string-list

*** Аналоговых
#+name: a-signals    
#+begin_src lisp :var s-names=s-names :exports both
  (defparameter *a-signals*
    (recoder/slist:a-signals *trd* *s-names*))

  ,*a-signals*
#+end_src

#+RESULTS: a-signals
: (#a-s(30 "V2" [0.0d0 25.0d0] "м3/с" "Объемный расход воздуха")
:  #a-s(89 "P02" [0.0d0 1000000.0d0] "Па" "Полное давление на входе в КС")
:  #a-s(24 "T2" [-10.0d0 600.0d0] "°C" "Т2 - средняя")
:  #a-s(25 "ET300" [0.0d0 1600.0d0] "°C" "Т3 - средняя"))

*** Дискретых
#+name: d-signals    
#+begin_src lisp :var s-names=s-names :exports both
  (defparameter *d-signals*
    (recoder/slist:d-signals *trd* *s-names*))

  ,*d-signals*
#+end_src

#+RESULTS: d-signals
: (#d-s(18 "FA530" "Кран грубой регулировки топливного газа ")
:  #d-s(47 "FK526" "Кран №42 топливного газа крановой площад")
:  #d-s(55 "FA526" "Кран грубой регулировки топливного газа ")
:  #d-s(63 "FA566" "Кран тонкой регулировки топливного газа "))

** Извлечение аналоговых сигналов
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-by-record recoder/trd:*trd* 1000 *a-signals*)
#+end_src

#+RESULTS:
|     V2 |      P02 |    T2 | ET300 |
|   м3/с |       Па |    °C |    °C |
| 0.1869 | 1.079d+5 | 11.61 | 1.660 |
| 0.1858 | 1.078d+5 | 12.50 | 2.271 |
| 0.1678 | 1.074d+5 | 12.99 | 2.197 |
| 0.1427 | 1.053d+5 | 12.67 | 2.319 |
| 0.1427 | 1.053d+5 | 12.97 | 2.246 |
| 0.1396 | 1.054d+5 | 13.23 | 3.442 |
| 0.1381 | 1.056d+5 | 13.44 | 10.23 |
| 0.1335 | 1.057d+5 | 13.65 | 46.09 |
| 0.1331 | 1.061d+5 | 13.84 | 130.2 |
| 0.1255 | 1.065d+5 | 14.05 | 421.8 |
| 0.1396 | 1.055d+5 | 14.36 | 17.80 |
| 0.1385 | 1.054d+5 | 14.55 | 3.149 |
| 0.1385 | 1.054d+5 | 14.78 | 2.222 |
| 0.1385 | 1.056d+5 | 14.97 | 15.09 |
| 0.1369 | 1.058d+5 | 15.18 | 65.48 |
| 0.1259 | 1.065d+5 | 15.39 | 408.6 |
| 0.1259 | 1.066d+5 | 15.51 | 439.6 |
| 0.1228 | 1.066d+5 | 15.72 | 454.5 |
| 0.1385 | 1.055d+5 | 16.03 | 76.93 |
| 0.1385 | 1.057d+5 | 16.21 | 27.71 |
| 0.1343 | 1.058d+5 | 16.54 | 153.7 |
| 0.1209 | 1.069d+5 | 16.61 | 579.0 |
| 0.1225 | 1.069d+5 | 16.75 | 579.5 |
| 0.1328 | 1.058d+5 | 16.89 | 186.8 |
| 0.1457 | 1.059d+5 | 17.46 | 18.73 |
| 0.1511 | 1.060d+5 | 17.74 | 4.395 |
| 0.1526 | 1.059d+5 | 18.05 | 2.417 |
| 0.1526 | 1.059d+5 | 18.26 | 2.393 |
| 0.1511 | 1.062d+5 | 18.44 | 17.11 |
| 0.1347 | 1.074d+5 | 18.70 | 482.8 |
| 0.1526 | 1.061d+5 | 18.85 | 50.39 |
| 0.1530 | 1.059d+5 | 19.10 | 6.275 |
| 0.1541 | 1.060d+5 | 19.36 | 2.759 |
| 0.1236 | 1.084d+5 | 19.39 | 802.8 |
| 0.1484 | 1.063d+5 | 19.48 | 178.8 |
| 0.1526 | 1.060d+5 | 19.83 | 17.31 |
| 0.1514 | 1.062d+5 | 20.14 | 21.02 |
| 0.1366 | 1.075d+5 | 20.32 | 469.0 |
| 0.1350 | 1.074d+5 | 20.37 | 520.2 |
| 0.1366 | 1.075d+5 | 20.63 | 482.4 |
| 0.1530 | 1.061d+5 | 21.01 | 45.56 |
| 0.1541 | 1.060d+5 | 21.12 | 7.276 |
| 0.1545 | 1.059d+5 | 21.41 | 3.247 |
| 0.1530 | 1.060d+5 | 21.54 | 2.710 |
| 0.1545 | 1.059d+5 | 21.83 | 2.466 |
| 0.1549 | 1.059d+5 | 22.08 | 2.515 |
| 0.1549 | 1.059d+5 | 22.23 | 2.515 |
| 0.1549 | 1.059d+5 | 22.42 | 2.661 |
| 0.1522 | 1.059d+5 | 22.60 | 2.539 |
| 0.1534 | 1.061d+5 | 22.89 | 15.01 |
| 0.1492 | 1.063d+5 | 22.98 | 57.33 |
| 0.1369 | 1.075d+5 | 23.24 | 477.9 |
| 0.1358 | 1.074d+5 | 23.24 | 496.0 |
| 0.1373 | 1.075d+5 | 23.43 | 494.8 |
| 0.1389 | 1.073d+5 | 23.56 | 420.4 |
| 0.1537 | 1.061d+5 | 23.92 | 24.98 |
| 0.1507 | 1.065d+5 | 24.20 | 97.95 |
| 0.1446 | 1.070d+5 | 24.27 | 222.2 |
| 0.1373 | 1.074d+5 | 24.48 | 449.7 |
| 0.1553 | 1.061d+5 | 24.72 | 31.10 |
| 0.1686 | 1.067d+5 | 25.04 | 6.372 |
| 0.2018 | 1.087d+5 | 25.42 | 3.711 |
| 0.1957 | 1.086d+5 | 25.45 | 3.003 |
| 0.2010 | 1.087d+5 | 25.89 | 2.905 |
| 0.1957 | 1.089d+5 | 25.96 | 26.68 |
| 0.1946 | 1.090d+5 | 26.20 | 47.10 |
| 0.1907 | 1.094d+5 | 26.39 | 98.93 |
| 0.1637 | 1.106d+5 | 26.48 | 564.5 |
| 0.1987 | 1.088d+5 | 26.62 | 23.24 |
| 0.1968 | 1.090d+5 | 26.86 | 34.03 |
| 0.1686 | 1.107d+5 | 26.97 | 568.7 |
| 0.1675 | 1.107d+5 | 27.09 | 572.3 |
| 0.1991 | 1.087d+5 | 27.26 | 28.88 |
| 0.2014 | 1.087d+5 | 27.44 | 6.079 |
| 0.2007 | 1.086d+5 | 27.65 | 3.784 |
| 0.2026 | 1.087d+5 | 27.82 | 3.467 |
| 0.2007 | 1.088d+5 | 28.03 | 15.45 |
| 0.1949 | 1.092d+5 | 28.15 | 73.05 |
| 0.1915 | 1.095d+5 | 28.31 | 116.7 |
| 0.1690 | 1.106d+5 | 28.24 | 506.4 |
| 0.1690 | 1.106d+5 | 28.38 | 532.1 |
| 0.1957 | 1.087d+5 | 28.62 | 35.25 |
| 0.2029 | 1.087d+5 | 28.81 | 7.056 |
| 0.1991 | 1.085d+5 | 28.95 | 4.175 |
| 0.2022 | 1.086d+5 | 29.11 | 3.711 |
| 0.1953 | 1.092d+5 | 29.37 | 71.97 |
| 0.1644 | 1.106d+5 | 29.21 | 561.9 |
| 0.1637 | 1.105d+5 | 29.18 | 551.5 |
| 0.1709 | 1.105d+5 | 29.48 | 517.2 |
| 0.2033 | 1.088d+5 | 29.72 | 21.85 |
| 0.1984 | 1.087d+5 | 29.96 | 6.250 |
| 0.1968 | 1.091d+5 | 30.05 | 57.94 |
| 0.1946 | 1.091d+5 | 30.10 | 103.7 |
| 0.1923 | 1.093d+5 | 30.24 | 117.0 |
| 0.1820 | 1.097d+5 | 30.29 | 255.5 |
| 0.1682 | 1.107d+5 | 30.43 | 552.8 |
| 0.1671 | 1.106d+5 | 30.33 | 579.4 |
| 0.1686 | 1.107d+5 | 30.50 | 565.1 |
| 0.2502 | 1.126d+5 | 31.50 | 41.11 |
| 0.3681 | 1.261d+5 | 35.08 | 7.349 |
| 0.4974 | 1.576d+5 | 34.98 | 5.054 |

#+name: recoder-get-trd-analog-by-utime
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-by-utime *trd* (+ (recoder/trd:<trd>-utime-start *trd*) 250) *a-signals*)
#+end_src

#+RESULTS: recoder-get-trd-analog-by-utime
| 0.13962005035477226d0 | 105607.69054703593d0 | 13.577172503242544d0 | 16.552986953536276d0 |

#+name: recoder-get-trd-analog-mid-by-utime 
#+begin_src lisp :var a-signals=a-signals :exports both
  (r/get:trd-analog-mid-by-utime *trd* (+ (r/trd:<trd>-utime-start *trd*) 250) *a-signals*)
#+end_src

#+RESULTS: recoder-get-trd-analog-mid-by-utime
| 0.13769450711542722d0 | 105569.90630233937d0 | 13.583377838813865d0 | 15.976341249859217d0 |

#+name: recoder-get-trd-analog-mid-by-snames
#+begin_src lisp :var a-signals=a-signals :exports both
  (r/get:trd-analog-mid-by-snames *trd* (+ (r/trd:<trd>-utime-start *trd*) 250) *s-names*)
#+end_src

#+RESULTS: recoder-get-trd-analog-mid-by-snames
| 0.13769450711542722d0 | 105569.90630233937d0 | 13.583377838813865d0 | 15.976341249859217d0 |
  
Возвращает список средних значений параметров, записанных в тренде trd
в момент времени utime для списка сигналов, определяемых их именами
snames.

Осреднение происходит в интервале записей от  n-before до n-after.

#+name: recoder-get-trd-analog-stddev-by-utime
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-stddev-by-utime recoder/trd:*trd*
                                          (+ (recoder/trd:<trd>-utime-start recoder/trd:*trd*) 250)
                                          ,*a-signals*)
#+end_src

#+RESULTS: recoder-get-trd-analog-stddev-by-utime
| 0.0018668003573623427d0 | 39.08783871633869d0 | 0.03398802269302918d0 | 1.126388905374254d0 |

#+name: recoder-get-trd-analog-stddev-by-utime
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-stddev-by-snames recoder/trd:*trd*
                                          (+ (recoder/trd:<trd>-utime-start recoder/trd:*trd*) 250)
                                          ,*s-names*)
#+end_src

*** Пример извлечения сигналов из тренда
    
#+name: make-table
#+begin_src lisp :var a-signals=a-signals :exports both
  (defparameter *utime*
    (loop :for ut :from (recoder/trd:<trd>-utime-start recoder/trd:*trd*) :to (recoder/trd:trd-utime-end recoder/trd:*trd*)
          :by (floor (- (recoder/trd:trd-utime-end recoder/trd:*trd*) (recoder/trd:<trd>-utime-start recoder/trd:*trd*))
                     100)
          :collect ut))

  (mnas-format:round-2d-list 
    (append
     (list (mapcar #'recoder/a-signal:<a-signal>-id *a-signals*))
     (list (mapcar #'recoder/a-signal:<a-signal>-units *a-signals*))
     (mapcar
      #'(lambda (ut)
          (r/get:trd-analog-by-utime  recoder/trd:*trd* ut *a-signals*))
      ,*utime*)))
#+end_src

#+RESULTS: make-table
|     V2 |      P02 |    T2 | ET300 |
|   м3/с |       Па |    °C |    °C |
| 0.1869 | 1.079d+5 | 11.61 | 1.660 |
| 0.1858 | 1.078d+5 | 12.50 | 2.271 |
| 0.1678 | 1.074d+5 | 12.99 | 2.197 |
| 0.1427 | 1.053d+5 | 12.67 | 2.319 |
| 0.1427 | 1.053d+5 | 12.97 | 2.246 |
| 0.1396 | 1.054d+5 | 13.23 | 3.442 |
| 0.1381 | 1.056d+5 | 13.44 | 10.23 |
| 0.1335 | 1.057d+5 | 13.65 | 46.09 |
| 0.1331 | 1.061d+5 | 13.84 | 130.2 |
| 0.1255 | 1.065d+5 | 14.05 | 421.8 |
| 0.1396 | 1.055d+5 | 14.36 | 17.80 |
| 0.1385 | 1.054d+5 | 14.55 | 3.149 |
| 0.1385 | 1.054d+5 | 14.78 | 2.222 |
| 0.1385 | 1.056d+5 | 14.97 | 15.09 |
| 0.1369 | 1.058d+5 | 15.18 | 65.48 |
| 0.1259 | 1.065d+5 | 15.39 | 408.6 |
| 0.1259 | 1.066d+5 | 15.51 | 439.6 |
| 0.1228 | 1.066d+5 | 15.72 | 454.5 |
| 0.1385 | 1.055d+5 | 16.03 | 76.93 |
| 0.1385 | 1.057d+5 | 16.21 | 27.71 |
| 0.1343 | 1.058d+5 | 16.54 | 153.7 |
| 0.1209 | 1.069d+5 | 16.61 | 579.0 |
| 0.1225 | 1.069d+5 | 16.75 | 579.5 |
| 0.1328 | 1.058d+5 | 16.89 | 186.8 |
| 0.1457 | 1.059d+5 | 17.46 | 18.73 |
| 0.1511 | 1.060d+5 | 17.74 | 4.395 |
| 0.1526 | 1.059d+5 | 18.05 | 2.417 |
| 0.1526 | 1.059d+5 | 18.26 | 2.393 |
| 0.1511 | 1.062d+5 | 18.44 | 17.11 |
| 0.1347 | 1.074d+5 | 18.70 | 482.8 |
| 0.1526 | 1.061d+5 | 18.85 | 50.39 |
| 0.1530 | 1.059d+5 | 19.10 | 6.275 |
| 0.1541 | 1.060d+5 | 19.36 | 2.759 |
| 0.1236 | 1.084d+5 | 19.39 | 802.8 |
| 0.1484 | 1.063d+5 | 19.48 | 178.8 |
| 0.1526 | 1.060d+5 | 19.83 | 17.31 |
| 0.1514 | 1.062d+5 | 20.14 | 21.02 |
| 0.1366 | 1.075d+5 | 20.32 | 469.0 |
| 0.1350 | 1.074d+5 | 20.37 | 520.2 |
| 0.1366 | 1.075d+5 | 20.63 | 482.4 |
| 0.1530 | 1.061d+5 | 21.01 | 45.56 |
| 0.1541 | 1.060d+5 | 21.12 | 7.276 |
| 0.1545 | 1.059d+5 | 21.41 | 3.247 |
| 0.1530 | 1.060d+5 | 21.54 | 2.710 |
| 0.1545 | 1.059d+5 | 21.83 | 2.466 |
| 0.1549 | 1.059d+5 | 22.08 | 2.515 |
| 0.1549 | 1.059d+5 | 22.23 | 2.515 |
| 0.1549 | 1.059d+5 | 22.42 | 2.661 |
| 0.1522 | 1.059d+5 | 22.60 | 2.539 |
| 0.1534 | 1.061d+5 | 22.89 | 15.01 |
| 0.1492 | 1.063d+5 | 22.98 | 57.33 |
| 0.1369 | 1.075d+5 | 23.24 | 477.9 |
| 0.1358 | 1.074d+5 | 23.24 | 496.0 |
| 0.1373 | 1.075d+5 | 23.43 | 494.8 |
| 0.1389 | 1.073d+5 | 23.56 | 420.4 |
| 0.1537 | 1.061d+5 | 23.92 | 24.98 |
| 0.1507 | 1.065d+5 | 24.20 | 97.95 |
| 0.1446 | 1.070d+5 | 24.27 | 222.2 |
| 0.1373 | 1.074d+5 | 24.48 | 449.7 |
| 0.1553 | 1.061d+5 | 24.72 | 31.10 |
| 0.1686 | 1.067d+5 | 25.04 | 6.372 |
| 0.2018 | 1.087d+5 | 25.42 | 3.711 |
| 0.1957 | 1.086d+5 | 25.45 | 3.003 |
| 0.2010 | 1.087d+5 | 25.89 | 2.905 |
| 0.1957 | 1.089d+5 | 25.96 | 26.68 |
| 0.1946 | 1.090d+5 | 26.20 | 47.10 |
| 0.1907 | 1.094d+5 | 26.39 | 98.93 |
| 0.1637 | 1.106d+5 | 26.48 | 564.5 |
| 0.1987 | 1.088d+5 | 26.62 | 23.24 |
| 0.1968 | 1.090d+5 | 26.86 | 34.03 |
| 0.1686 | 1.107d+5 | 26.97 | 568.7 |
| 0.1675 | 1.107d+5 | 27.09 | 572.3 |
| 0.1991 | 1.087d+5 | 27.26 | 28.88 |
| 0.2014 | 1.087d+5 | 27.44 | 6.079 |
| 0.2007 | 1.086d+5 | 27.65 | 3.784 |
| 0.2026 | 1.087d+5 | 27.82 | 3.467 |
| 0.2007 | 1.088d+5 | 28.03 | 15.45 |
| 0.1949 | 1.092d+5 | 28.15 | 73.05 |
| 0.1915 | 1.095d+5 | 28.31 | 116.7 |
| 0.1690 | 1.106d+5 | 28.24 | 506.4 |
| 0.1690 | 1.106d+5 | 28.38 | 532.1 |
| 0.1957 | 1.087d+5 | 28.62 | 35.25 |
| 0.2029 | 1.087d+5 | 28.81 | 7.056 |
| 0.1991 | 1.085d+5 | 28.95 | 4.175 |
| 0.2022 | 1.086d+5 | 29.11 | 3.711 |
| 0.1953 | 1.092d+5 | 29.37 | 71.97 |
| 0.1644 | 1.106d+5 | 29.21 | 561.9 |
| 0.1637 | 1.105d+5 | 29.18 | 551.5 |
| 0.1709 | 1.105d+5 | 29.48 | 517.2 |
| 0.2033 | 1.088d+5 | 29.72 | 21.85 |
| 0.1984 | 1.087d+5 | 29.96 | 6.250 |
| 0.1968 | 1.091d+5 | 30.05 | 57.94 |
| 0.1946 | 1.091d+5 | 30.10 | 103.7 |
| 0.1923 | 1.093d+5 | 30.24 | 117.0 |
| 0.1820 | 1.097d+5 | 30.29 | 255.5 |
| 0.1682 | 1.107d+5 | 30.43 | 552.8 |
| 0.1671 | 1.106d+5 | 30.33 | 579.4 |
| 0.1686 | 1.107d+5 | 30.50 | 565.1 |
| 0.2502 | 1.126d+5 | 31.50 | 41.11 |
| 0.3681 | 1.261d+5 | 35.08 | 7.349 |
| 0.4974 | 1.576d+5 | 34.98 | 5.054 |

** Извлечение дискретных сигналов
*recoder:trd-discret-by-rec-number*       (trd trd) rec-number d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи с номером rec-number тренда trd в виде 0 или 1.

*recoder:trd-discret-by-rec-number-t-nil* (trd trd) rec-number d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи с номером rec-number тренда trd в виде NIL или T.

*recoder:trd-discret-by-utime*            (trd trd) utime      d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи соответствующей времени utime тренда trd в виде 0 или 1.

*recoder:trd-discret-by-utime-t-nil*      (trd trd) utime      d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи соответствующей времени utime тренда trd в виде NIL или T.

* Примеры использования  

#+BEGIN_SRC lisp
  (recoder:trd-record-number-by-utime)

  (recoder:trd-analog-by-utime)

  (let ((d-s-l (recoder:trd-discret-signal-list ot-234pm::*trd* '("PH016" "PH017"))))
    (mapcar #'(lambda (ut)
		(recoder:trd-discret-by-utime-t-nil ot-234pm::*trd* ut d-s-l))
	    ot-234pm::*utimes*))
#+END_SRC

** ORG
#+name:recoder-org-header
#+begin_src lisp
  (recoder/org:header recoder/trd:*trd*)
#+end_src

#+RESULTS: recoder-org-header
| Файл                                | D:/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/2018-11-06_092329.trd |
| Версия тренда                       |                                                                                          2 |
| Дата создания тренда                |                                                                                 2018-11-06 |
| Время создания тренда               |                                                                                   09:23:29 |
| К-во аналоговых+дискретных сигналов |                                                                                        415 |
| Общее число записей в тренде        |                                                                                      15706 |
| Интервал между записями тренда      |                                                                                     0.25d0 |
| Количество аналоговых сигналов      |                                                                                        314 |
| Количество дискретных сигналов      |                                                                                        101 |

   
   
#+name:recoder-org-analog-signals
#+begin_src lisp
  (recoder/org:analog-signals  recoder/trd:*trd*)
#+end_src

#+RESULTS: recoder-org-analog-signals
| Файл                                | D:/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/2018-11-06_092329.trd |
| Версия тренда                       |                                                                                          2 |
| Дата создания тренда                |                                                                                 2018-11-06 |
| Время создания тренда               |                                                                                   09:23:29 |
| К-во аналоговых+дискретных сигналов |                                                                                        415 |
| Общее число записей в тренде        |                                                                                      15706 |
| Интервал между записями тренда      |                                                                                     0.25d0 |
| Количество аналоговых сигналов      |                                                                                        314 |
| Количество дискретных сигналов      |                                                                                        101 |

#+name:recoder-org-discret-signals
#+begin_src lisp
  (recoder/org:discret-signals recoder/trd:*trd*)
#+end_src

#+RESULTS: recoder-org-discret-signals
|   0 | FH020 | Дроссельный кран рабочего насоса ДТ - от |
|   1 | FH021 | Дроссельный кран рабочего насоса ДТ - за |
|   2 | FA010 | Кран регулировки подачи ДТ 1-го канала - |
|   3 | FA011 | Кран регулировки подачи ДТ 1-го канала - |
|   4 | FA020 | Кран регулировки подачи ДТ 2-го канала - |
|   5 | FA021 | Кран регулировки подачи ДТ 2-го канала - |
|   6 | FK510 | Кран №41 топливного газа крановой площад |
|   7 | FK511 | Кран №41 топливного газа крановой площад |
|   8 | FK520 | Кран №42 топливного газа крановой площад |
|   9 | FK521 | Кран №42 топливного газа крановой площад |
|  10 | FK530 | Кран №43 топливного газа крановой площад |
|  11 | FK531 | Кран №43 топливного газа крановой площад |
|  12 | FK540 | Кран №46 топливного газа крановой площад |
|  13 | FK541 | Кран №46 топливного газа крановой площад |
|  14 | FA510 | Кран грубой регулировки топливного газа  |
|  15 | FA511 | Кран грубой регулировки топливного газа  |
|  16 | FA520 | Кран грубой регулировки топливного газа  |
|  17 | FA521 | Кран грубой регулировки топливного газа  |
|  18 | FA530 | Кран грубой регулировки топливного газа  |
|  19 | FA531 | Кран грубой регулировки топливного газа  |
|  20 | FA540 | Кран грубой регулировки топливного газа  |
|  21 | FA541 | Кран грубой регулировки топливного газа  |
|  22 | FA550 | Кран тонкой регулировки топливного газа  |
|  23 | FA551 | Кран тонкой регулировки топливного газа  |
|  24 | FA560 | Кран тонкой регулировки топливного газа  |
|  25 | FA561 | Кран тонкой регулировки топливного газа  |
|  26 | FA570 | Кран тонкой регулировки топливного газа  |
|  27 | FA571 | Кран тонкой регулировки топливного газа  |
|  28 | FA580 | Кран тонкой регулировки топливного газа  |
|  29 | FA581 | Кран тонкой регулировки топливного газа  |
|  30 | NJ010 | Загазованность бокса 9  - порог 0.5%     |
|  31 | NJ020 | Загазованность бокса 9 - порог 1%        |
|  32 | PH030 | Задвижка технологического воздуха левой  |
|  33 | PH031 | Задвижка технологического воздуха левой  |
|  34 | PH040 | Задвижка технологического воздуха правой |
|  35 | PH041 | Задвижка технологического воздуха правой |
|  36 | FH026 | Дроссельный кран рабочего насоса ДТ - от |
|  37 | FH027 | Дроссельный кран рабочего насоса ДТ - за |
|  38 | FA016 | Кран регулировки подачи жидкого топлива  |
|  39 | FA017 | Кран регулировки подачи жидкого топлива  |
|  40 | FA026 | Кран регулировки подачи жидкого топлива  |
|  41 | FA027 | Кран регулировки подачи жидкого топлива  |
|  42 | FR017 | Агрегат зажигания - отключить            |
|  43 | FR016 | Агрегат зажигания - включить             |
|  44 | FR018 | Клапан пускового газа                    |
|  45 | FK516 | Кран №41 топливного газа крановой площад |
|  46 | FK517 | Кран №41 топливного газа крановой площад |
|  47 | FK526 | Кран №42 топливного газа крановой площад |
|  48 | FK527 | Кран №42 топливного газа крановой площад |
|  49 | FK536 | Кран №43 топливного газа крановой площад |
|  50 | FK537 | Кран №43 топливного газа крановой площад |
|  51 | FK546 | Кран №46 топливного газа крановой площад |
|  52 | FK547 | Кран №46 топливного газа крановой площад |
|  53 | FA516 | Кран грубой регулировки топливного газа  |
|  54 | FA517 | Кран грубой регулировки топливного газа  |
|  55 | FA526 | Кран грубой регулировки топливного газа  |
|  56 | FA527 | Кран грубой регулировки топливного газа  |
|  57 | FA536 | Кран грубой регулировки топливного газа  |
|  58 | FA537 | Кран грубой регулировки топливного газа  |
|  59 | FA546 | Кран грубой регулировки топливного газа  |
|  60 | FA547 | Кран грубой регулировки топливного газа  |
|  61 | FA556 | Кран тонкой регулировки топливного газа  |
|  62 | FA557 | Кран тонкой регулировки топливного газа  |
|  63 | FA566 | Кран тонкой регулировки топливного газа  |
|  64 | FA567 | Кран тонкой регулировки топливного газа  |
|  65 | FA576 | Кран тонкой регулировки топливного газа  |
|  66 | FA577 | Кран тонкой регулировки топливного газа  |
|  67 | FA586 | Кран тонкой регулировки топливного газа  |
|  68 | FA587 | Кран тонкой регулировки топливного газа  |
|  69 | FR010 | Агрегат зажигания - включен              |
|  70 | FR011 | Агрегат зажигания - отключен             |
|  71 | PH036 | Задвижка технологического воздуха левой  |
|  72 | PH037 | Задвижка технологического воздуха левой  |
|  73 | PH046 | Задвижка технологического воздуха правой |
|  74 | PH047 | Задвижка технологического воздуха правой |
|  75 | PM016 | Аварийная вентиляция - включить          |
|  76 | NJ030 | Загазованность бокса 9 - отказ           |
|  77 | FH036 | Клапан слива 1-го канала                 |
|  78 | FH046 | Клапан слива 2 -го канала                |
|  79 | GAS   | Газообразное топливо                     |
|  80 | OIL   | Жидкое топливо                           |
|  81 | FM010 | Топливный насос - включен                |
|  82 | FM011 | Топливный насос - отключен               |
|  83 | VM010 | Насос воды - включен                     |
|  84 | VM011 | Насос воды - отключен                    |
|  85 | PH010 | Кран регулировки подачи техн. воздуха -  |
|  86 | PH011 | Кран регулировки подачи техн. воздуха -  |
|  87 | VH010 | Кран регулировки подачи питьевой воды -  |
|  88 | VH011 | Кран регулировки подачи питьевой воды -  |
|  89 | FM016 | Рабочий насос ДТ - включить              |
|  90 | FM017 | Рабочий насос ДТ - отключить             |
|  91 | VM016 | Насос воды - включить                    |
|  92 | VM017 | Насос воды - отключить                   |
|  93 | PH016 | Кран регулировки подачи технического воз |
|  94 | PH017 | Кран регулировки подачи технического воз |
|  95 | VH016 | Кран регулировки подачи воды - открыть   |
|  96 | VH017 | Кран регулировки подачи воды - закрыть   |
|  97 | VH026 | Кран перепуска воды - открыть            |
|  98 | VH027 | Кран перепуска воды - закрыть            |
|  99 | FH010 | Кран подачи ДТ - открыт                  |
| 100 | FH011 | Кран подачи ДТ - закрыт                  |



